## Target Guided Encoding 
### It is a technique used to encode categorical variables based on their relationship with the target variables. This encoding technique is useful when we have a categorical variables and we want to use this variable as a feature in our ML model

### In Target Guided Ordinal Encoding we replace each categorical variable with a numerical value based on the mean or median of the target variable for that category. This create a monotonic relationship between the categorical variables and the target variable, which can improve the predictive power of our model

In [1]:
import pandas as pd

# create simple dataframe with a categorical variables and a target variables
dataset = pd.DataFrame({
    'city': ['India','New York','Paris','Tokyo','Paris','India'],
    'price': [200,140,600,500,123,674]
})

In [3]:
dataset

       city  price
0     India    200
1  New York    140
2     Paris    600
3     Tokyo    500
4     Paris    123
5     India    674

In [5]:
mean_price=dataset.groupby('city')['price'].mean().to_dict()

In [6]:
mean_price

{'India': 437.0, 'New York': 140.0, 'Paris': 361.5, 'Tokyo': 500.0}

In [7]:
dataset['city_encoded']=dataset['city'].map(mean_price)

In [8]:
dataset

       city  price  city_encoded
0     India    200         437.0
1  New York    140         140.0
2     Paris    600         361.5
3     Tokyo    500         500.0
4     Paris    123         361.5
5     India    674         437.0